dahanzimin/micropython/ports/esp32/boards/MixGo_TI/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "MixGo TI"
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

#define MICROPY_PY_MACHINE_DAC              (0)

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

//#define MICROPY_HW_I2C0_SCL                 (9)
//#define MICROPY_HW_I2C0_SDA                 (8)

//#define MICROPY_HW_SPI1_MOSI                (35)
//#define MICROPY_HW_SPI1_MISO                (37)
//#define MICROPY_HW_SPI1_SCK                 (36)
